
interface FaqItem {
  id: number;
  question: string;
  answer: string;
  icon?: string;
  iconPosition?: 'left' | 'right';
}
export const faqSectionData:FaqItem[] =   [
    {
      answer: 'يقوم المحامي الذكي بتحليل المستندات القانونية التي ترفعها (مثل المذكرات والعقود) باستخدام تقنيات الذكاء الاصطناعي المتقدمة، ثم يقدم لك اقتراحات وصياغات قانونية دقيقة بناءً على القوانين والسوابق القضائية.',
      icon: '⚖️',
      iconPosition: 'right',
      id: 1,
      question: 'كيف يعمل المحامي الذكي؟',
    },
    {
      answer: 'نعم، نولي أقصى درجات الأهمية لأمن وسرية بياناتك. نستخدم بروتوكولات تشفير متقدمة ونتعهد بعدم مشاركة أي معلومات مع أطراف ثالثة.',
      id: 2,
      question: 'هل بياناتي ومستنداتي آمنة؟',
    },
    {
      answer: 'نقدم مجموعة واسعة من الخدمات القانونية تشمل قانون الشركات، القانون العقاري، القانون الجنائي، قانون الأسرة، بالإضافة إلى خدمات التحليل القانوني عبر المحامي الذكي والاستشارات المباشرة.',
      id: 3,
      question: 'ما هي الخدمات التي تقدمونها؟',
    },
    {
      answer: 'يمكنك حجز استشارة بسهولة من خلال قسم "تواصل معنا" في الموقع. املأ النموذج وسيقوم أحد أعضاء فريقنا بالتواصل معك لتحديد موعد.',
      icon: '📅',
      iconPosition: 'left',
      id: 4,
      question: 'كيف يمكنني حجز استشارة؟',
    },
  ]